//  2. Даны два числа. Показать большее и меньшее число

// start

int a = -8, b = 0;   // Ввели две переменные и присвоили им значения

if(a > b)
{
    Console.WriteLine(a);
}
else
{
    Console.WriteLine(b);
}