HW008_TasksLibrary.Task054();
Console.WriteLine();


HW008_TasksLibrary.Task056();
Console.WriteLine();

HW008_TasksLibrary.Task060();
Console.WriteLine();

// Сложная | можно пропустить
// Задача 58: Задайте две матрицы. Напишите программу, которая будет находить произведение двух матриц.
// Например, даны 2 матрицы:
// 2 4 | 3 4
// 3 2 | 3 3
// Результирующая матрица будет:
// 18 20
// 15 18