// 15. Дано число. Проверить кратно ли оно 7 и 23
 Tasks_Library.Task15();

// 16. Дано число обозначающее день недели. Выяснить является номер дня недели выходным 
Tasks_Library.Task16();

// 17. По двум заданным числам проверять является ли одно квадратом другого
Tasks_Library.Task17();

// 18. Проверить истинность утверждения ¬(X ⋁ Y) = ¬X ⋀ ¬Y
// 19. Определить номер четверти плоскости, в которой находится точка с координатами Х и У, причем X ≠ 0 и Y ≠ 0
// 20. Задать номер четверти, показать диапазоны для возможных координат
// 21. Программа проверяет пятизначное число на палиндромом.
// 22. Найти расстояние между точками в пространстве 2D/3D