//  5. Написать программу вычисления значения функции y = f(a)

// Например решим функция y = Sin(a)

//start

int a = 13;

double result = Math.Sin(a);
Console.WriteLine(result);


