//Урок 7. Двумерные массивы
// TasksHW07_Library.Task047();
Console.WriteLine();


TasksHW07_Library.Task050();
Console.WriteLine();

// Задача 52. Задайте двумерный массив из целых чисел. Найдите среднее арифметическое элементов в каждом столбце.
// Например, задан массив:
// 1 4 7 2
// 5 9 2 3
// 8 4 2 4
// Среднее арифметическое каждого столбца: 4,6; 5,6; 3,6; 3.


// ИЛИ ОДНА НО ТАКАЯ:
// Создать приложение по обработке двумерного массива строк.
// Если сложно, массив может сделать одномерным
// Приложение позволяет сгенерирвать массив и показать сколько в этом массиве "слов" содержащих восклицательный знак ("!")
// Требование: минимум 4 метода, IndexOf использовать нельзя
