//Урок 7. Двумерные массивы
TasksHW07_Library.Task047();
Console.WriteLine();


TasksHW07_Library.Task050();
Console.WriteLine();

TasksHW07_Library.Task052();
Console.WriteLine();


// ИЛИ ОДНА НО ТАКАЯ:
// Создать приложение по обработке двумерного массива строк.
// Если сложно, массив может сделать одномерным
// Приложение позволяет сгенерирвать массив и показать сколько в этом массиве "слов" содержащих восклицательный знак ("!")
// Требование: минимум 4 метода, IndexOf использовать нельзя
