
// HW009_TasksLibrary.Task064();
// Console.WriteLine();


HW009_TasksLibrary.Task066();

// Задача 68: Напишите программу вычисления 
// функции Аккермана с помощью рекурсии. 
// Даны два неотрицательных числа m и n.
// m = 2, n = 3 -> A(m,n) = 9
// m = 3, n = 2 -> A(m,n) = 29
